Tekla.Structures.Model.BendSurface
The BendSurface class defines a surface contour that can be used as a bend between two plates

Tekla.Structures.Model.BendSurface.InwardCurved
Gets the direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.

Tekla.Structures.Model.BendSurface.IntersectionLine
Gets intersection line.

Tekla.Structures.Model.BendSurface.EndFaceNormal1
Gets the first end face normal.

Tekla.Structures.Model.BendSurface.EndFaceNormal2
Gets the second end face normal.

Tekla.Structures.Model.BendSurface.CenterLine
Gets the center line of the bend surface (i.e. the line that crosses every circular cross section of the
bend at their center point)

Tekla.Structures.Model.BendSurface.RotationAxis
Gets the unit vector that defines the rotation axis (for counter clockwise rotations) of the lateral
boundaries of the surface. This axis is always parallel to the direction of the center line.

Tekla.Structures.Model.BendSurface.LateralBoundary1
Gets or sets the first lateral boundary

Tekla.Structures.Model.BendSurface.LateralBoundary2
Gets or sets the second lateral boundary

Tekla.Structures.Model.BendSurface.SideBoundary1
Gets or sets the first side boundary.

Tekla.Structures.Model.BendSurface.SideBoundary2
Gets or sets the second side boundary.

Tekla.Structures.Model.BendSurface.#ctor(Tekla.Structures.Geometry3d.Arc,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.Model.BendSurface class from a base arc, a height and a radius at the top.
This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
baseArc: Arc to form the base of the bend surface
height: Height of the surface measured along the normal of the arc, may be positive or
negative, but always nonzero
radiusAtHeight: Radius of the arc located at the given height. Must be positive
Throws System.ArgumentException: Thrown if the given lengths are invalid

Tekla.Structures.Model.BendSurface.#ctor(System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Geometry3d.Line,Tekla.Structures.Geometry3d.Vector)
Initializes a new instance of the Tekla.Structures.Model.BendSurface class from the cone lateral boundaries and the center line.
This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface
lateralBoundary1: The first lateral boundary.
lateralBoundary2: The second lateral boundary
centerLine: The center line of the cone/cylinder
rotationAxis:
A vector normal to the circular cross sections of the surface. It defines the rotation axis from the
start of a lateral boundary to the end of the same lateral boundary, according to the right hand rule.

Tekla.Structures.Model.BendSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Initializes a new instance of the Tekla.Structures.Model.BendSurface class with given parameters.
The boundaries are defined by the side boundaries (i.e. generator lines of the surface).
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1: The first end face normal.
endFaceNormal2: The second end face normal.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.
Throws System.ArgumentNullException: Throws exception if one of the arguments has null value.

Tekla.Structures.Model.BendSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point},System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Initializes a new instance of the Tekla.Structures.Model.BendSurface class with given parameters.
The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the surface).
The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
Remarks: This constructor may be numerically instable if the end faces are very close
endFaceNormal1:  The first end face normal.
endFaceNormal2:  The second end face normal.
lateralBoundary1:  The first lateral boundary
lateralBoundary2:  The second lateral boundary
Throws System.ArgumentNullException:  Throws an exception if one of the arguments is null.
Throws System.ArgumentException:  Throws this exception if the boundaries are invalid.

Tekla.Structures.Model.BendSurface.GetFirstFaceNormal
Gets the first face normal
Returns: The face normal of the bend surface at the first face

Tekla.Structures.Model.BendSurface.GetSecondFaceNormal
Gets the second face normal
Returns: The face normal of the bend surface at the second face

Tekla.Structures.Model.BendSurface.SetLateralBoundaries(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Sets lateral boundaries using side boundaries.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.

Tekla.Structures.Model.BendSurface.CreateCollinearSegment(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Returns a line segment in the same direction as originalSide.
originalSide: Side to get direction from.
newSide: Side to be checked.
Returns: Returns a line segment in the same direction as originalSide.

Tekla.Structures.Model.BendSurface.ModifySideBoundary(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Returns new line segment as a new side boundary after validations.
newSideBoundary: New side segment to set.
sideToUpdate: Old side segment to change.
Returns: Returns new line segment as a new side boundary.
Throws System.ArgumentException: Throws exception if distance between new side points is too small.

Tekla.Structures.Model.BendSurface.GetIntersectionLine(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Calculates intersection line between two plates
endFaceNormal1: The first end face normal
endFaceNormal2: The second end face normal
Returns: The intersection line.

Tekla.Structures.Model.BendSurface.IsInwardCurved
Calculate Inward/Outward curve flag.
Returns: True if the curve is oriented towards the intersection line, false otherwise.

Tekla.Structures.Model.BendSurface.IsConeOrthogonalToIntersection(Tekla.Structures.Geometry3d.Line)
Checks if the conical surface is orthogonal to the intersection line
intersectionLine: Intersection line of the plates
Returns: True if the cone is orthogonal to the intersection line, false otherwise

Tekla.Structures.Model.BendSurface.GetUShapeCylinderCenterLine(Tekla.Structures.Geometry3d.Vector)
Gets the center line for a cylinder between parallel plates
endFaceNormal1: End face normal of the first face
Returns: The directed center line

Tekla.Structures.Model.BendSurface.GetUShapeConeCenterLine(Tekla.Structures.Geometry3d.Vector)
Gets the center line of a cone orthogonal to the intersection line of the plates
endFaceNormal1: First face end normal
Returns: The directed center line

Tekla.Structures.Model.BendSurface.CalculateCenterLine(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Calculates the conical surface center line.
endFaceNormal1: First end face normal
endFaceNormal2: Second end face normal